In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("employee_data.csv")

In [13]:
df["tax"]=df["Salary"].apply(lambda x: "25%" if x>50000 else "15%")

In [4]:
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [5]:
# map function
map_value={"IT":"Information Technology","HR":"Human Resources","Finance":"Finance","Marketing":"Marketing"}
df["Department"]=df["Department"].map(map_value)

In [6]:
df

   ID     Name  Age              Department  Salary
0   1    Alice   25         Human Resources   55000
1   2      Bob   32  Information Technology   72000
2   3  Charlie   28                 Finance   48000
3   4    David   45               Marketing   91000
4   5      Eva   38  Information Technology   65000
5   6    Frank   29                 Finance   50000
6   7    Grace   41         Human Resources   82000
7   8   Hannah   26               Marketing   47000
8   9      Ian   35  Information Technology   75000
9  10    Julia   30                 Finance   60000

In [7]:
# assign function

df.assign(new_salary=df["Salary"]*1.1)

   ID     Name  Age              Department  Salary  new_salary
0   1    Alice   25         Human Resources   55000     60500.0
1   2      Bob   32  Information Technology   72000     79200.0
2   3  Charlie   28                 Finance   48000     52800.0
3   4    David   45               Marketing   91000    100100.0
4   5      Eva   38  Information Technology   65000     71500.0
5   6    Frank   29                 Finance   50000     55000.0
6   7    Grace   41         Human Resources   82000     90200.0
7   8   Hannah   26               Marketing   47000     51700.0
8   9      Ian   35  Information Technology   75000     82500.0
9  10    Julia   30                 Finance   60000     66000.0

In [12]:
# replace function
df["Department"].replace("Information Technology","IT")

0    Human Resources
1                 IT
2            Finance
3          Marketing
4                 IT
5            Finance
6    Human Resources
7          Marketing
8                 IT
9            Finance
Name: Department, dtype: object

In [16]:
#changing column names
df.columns=["E_ID","NAME","AGE","DEPARTMENT","SALARY"]
df #now column names will be changed

   E_ID     NAME  AGE              DEPARTMENT  SALARY
0     1    Alice   25         Human Resources   55000
1     2      Bob   32  Information Technology   72000
2     3  Charlie   28                 Finance   48000
3     4    David   45               Marketing   91000
4     5      Eva   38  Information Technology   65000
5     6    Frank   29                 Finance   50000
6     7    Grace   41         Human Resources   82000
7     8   Hannah   26               Marketing   47000
8     9      Ian   35  Information Technology   75000
9    10    Julia   30                 Finance   60000

   E_ID     NAME  AGE              DEPARTMENT  SALARY
0     1    Alice   25         Human Resources   55000
1     2      Bob   32  Information Technology   72000
2     3  Charlie   28                 Finance   48000
3     4    David   45               Marketing   91000
4     5      Eva   38  Information Technology   65000
5     6    Frank   29                 Finance   50000
6     7    Grace   41         Human Resources   82000
7     8   Hannah   26               Marketing   47000
8     9      Ian   35  Information Technology   75000
9    10    Julia   30                 Finance   60000

In [20]:
df=df.rename(columns={"E_ID":"ID"})
df #E_ID became ID

   ID     NAME  AGE              DEPARTMENT  SALARY
0   1    Alice   25         Human Resources   55000
1   2      Bob   32  Information Technology   72000
2   3  Charlie   28                 Finance   48000
3   4    David   45               Marketing   91000
4   5      Eva   38  Information Technology   65000
5   6    Frank   29                 Finance   50000
6   7    Grace   41         Human Resources   82000
7   8   Hannah   26               Marketing   47000
8   9      Ian   35  Information Technology   75000
9  10    Julia   30                 Finance   60000

In [24]:
#rename index
df.rename(index={1:"First"})

       ID     NAME  AGE              DEPARTMENT  SALARY
0       1    Alice   25         Human Resources   55000
First   2      Bob   32  Information Technology   72000
2       3  Charlie   28                 Finance   48000
3       4    David   45               Marketing   91000
4       5      Eva   38  Information Technology   65000
5       6    Frank   29                 Finance   50000
6       7    Grace   41         Human Resources   82000
7       8   Hannah   26               Marketing   47000
8       9      Ian   35  Information Technology   75000
9      10    Julia   30                 Finance   60000